In [1]:
import pandas as pd
df = pd.read_csv("stock_price_data_with_date.csv")

In [2]:
df.head(2)

       Date  adaniports  asianpaints  axisbank   cipla      tcs
0  01/01/08     1296.85      1123.19    972.55  211.10  1054.55
1  02/01/08     1307.45      1135.45   1034.65  218.85  1050.00

In [3]:
pd.melt(df.drop("Date",axis=1))

        variable    value
0     adaniports  1296.85
1     adaniports  1307.45
2     adaniports  1275.80
3     adaniports  1240.35
4     adaniports  1227.25
...          ...      ...
1225         tcs   478.15
1226         tcs   471.65
1227         tcs   476.80
1228         tcs   482.55
1229         tcs   477.90

[1230 rows x 2 columns]

In [4]:
df['cipla']

0      211.10
1      218.85
2      216.35
3      213.65
4      212.65
        ...
241    181.05
242    181.95
243    184.00
244    183.90
245    186.60
Name: cipla, Length: 246, dtype: float64

In [6]:
df['cipla'].quantile(0.20) ## 20th percentile

188.35

In [9]:
df[df['cipla']>180].shape[0]

232

In [10]:
df.shape[0]

246

In [11]:
### Cipla, if out of 10 days if the change in stock price is positive for 7 days, I make money.
### What is the probability that I will make money?

In [12]:
### How many time was the change in price from one day to the other was positive?

         Date  adaniports  asianpaints  axisbank   cipla      tcs
0    01/01/08     1296.85      1123.19    972.55  211.10  1054.55
1    02/01/08     1307.45      1135.45   1034.65  218.85  1050.00
2    03/01/08     1275.80      1133.90   1035.85  216.35  1011.05
3    04/01/08     1240.35      1150.08   1054.90  213.65  1005.20
4    07/01/08     1227.25      1182.62   1090.15  212.65   975.60
..        ...         ...          ...       ...     ...      ...
241  24/12/08      312.80       868.23    490.75  181.05   478.15
242  26/12/08      305.45       868.44    482.80  181.95   471.65
243  29/12/08      315.75       867.77    494.95  184.00   476.80
244  30/12/08      319.70       873.45    510.25  183.90   482.55
245  31/12/08      325.30       883.53    504.70  186.60   477.90

[246 rows x 6 columns]

In [27]:
df['cipla'].shift()

0         NaN
1      211.10
2      218.85
3      216.35
4      213.65
        ...
241    182.00
242    181.05
243    181.95
244    184.00
245    183.90
Name: cipla, Length: 246, dtype: float64

In [17]:
df['price_change_cipla']=df['cipla']-df['cipla'].shift()

In [18]:
df

,Date,adaniports,asianpaints,axisbank,cipla,tcs,price_change_cipla
0,01/01/08,1296.85,1123.19,972.55,211.10,1054.55,NaN
1,02/01/08,1307.45,1135.45,1034.65,218.85,1050.00,7.75
2,03/01/08,1275.80,1133.90,1035.85,216.35,1011.05,-2.50
3,04/01/08,1240.35,1150.08,1054.90,213.65,1005.20,-2.70
4,07/01/08,1227.25,1182.62,1090.15,212.65,975.60,-1.00
...,...,...,...,...,...,...,...
241,24/12/08,312.80,868.23,490.75,181.05,478.15,-0.95
242,26/12/08,305.45,868.44,482.80,181.95,471.65,0.90
243,29/12/08,315.75,867.77,494.95,184.00,476.80,2.05
244,30/12/08,319.70,873.45,510.25,183.90,482.55,-0.10
245,31/12/08,325.30,883.53,504.70,186.60,477.90,2.70

In [20]:
### How many time was the change in price from one day to the other was positive?
df[df['price_change_cipla']>0].shape[0]

123

In [21]:
df.shape[0]

246

In [22]:
## On an average what is the chance that the stock price change in cipla be positive?
123/246

0.5

In [23]:
### Cipla, if out of 10 days if the change in stock price is positive for 7 days, I make money.
### What is the probability that I will make money?

In [25]:
from scipy.stats import binom

In [26]:
binom.pmf(7,10,0.5)

0.11718750000000004